syty-auction-master/artillery/load_test.yml
config:
  target: "https://ccg2017.herokuapp.com"
  processor: "./loadtest.js"
  phases:
    - duration: 300
      arrivalRate: 5
scenarios:
  - name: "Connect and Watch"
    weight: 2
    flow:
      - get:
          url: "/"
      - think: 1
  - name: "Connect and Bid"
    weight: 1
    flow:
      - get:
          url: "/"
      - think: 1
      - loop:
          - function: "generateRandomBid"
          - post:
              url: "/adminSubmit"
              json:
                firstName: "{{ firstName }}"
                lastName: "{{ lastName }}"
                company: "{{ company }}"
                slot: "{{ slot }}"
                bid: "{{ bid }}"
          - think: 5
        count: 10